# How to merge dataframe

In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({
    "City":["Gwalior","Delhi","Mumbai"],
    "Temperature":[39,42,32]
})

In [4]:
df1

      City  Temperature
0  Gwalior           39
1    Delhi           42
2   Mumbai           32

In [5]:
df2 = pd.DataFrame({
    "City":["Mumbai","Gwalior","Delhi"],
    "Wind_speed":[12,18,15]
})

In [6]:
df2

      City  Wind_speed
0   Mumbai          12
1  Gwalior          18
2    Delhi          15

In [7]:
df3 = pd.merge(df1,df2,on = "City")

In [8]:
df3

      City  Temperature  Wind_speed
0  Gwalior           39          18
1    Delhi           42          15
2   Mumbai           32          12

In [10]:
df4 =  pd.DataFrame({
    "City":["Mumbai","Gwalior","Delhi","bhopal","Pune"],
    "Wind_speed":[12,18,15,13,11]
})

In [11]:
df4

      City  Wind_speed
0   Mumbai          12
1  Gwalior          18
2    Delhi          15
3   bhopal          13
4     Pune          11

In [12]:
df5 = pd.DataFrame({
    "City":["Gwalior","Delhi","Mumbai"],
    "Temperature":[39,42,32]
})

In [13]:
df5

      City  Temperature
0  Gwalior           39
1    Delhi           42
2   Mumbai           32

In [14]:
# Lets we merge df4 or df5

In [19]:
df6 = pd.merge(df4,df5,on = "City",how = "left")

In [20]:
df6

      City  Wind_speed  Temperature
0   Mumbai          12         32.0
1  Gwalior          18         39.0
2    Delhi          15         42.0
3   bhopal          13          NaN
4     Pune          11          NaN